const e={en:"English",zh:"中文"},n="Swap",s="Play",t="跨链 × 游戏 × 实体 的超级融合体",A="Twitter",c="Telegram",p={chapter1:"序章",missions:"生态",roles:"角色",community:"社区",foundation:"基金会",about:"关于"},a={aside:{chapter1:"Chapter Ⅰ",episode1:"Episode 1",episode2:"Episode 2",episode3:"Episode 3"},section1:{d:`AI觉醒，秩序崩塌
它们曾是智慧的巅峰，如今却是人类最深的噩梦。AI怪兽，独立于规则之外的虚拟生命，正在网络深处迅速扩散。
吞噬资源，控制节点，威胁能源、金融与社会的运转。它们的野心不止于此，世界的未来正在被重写，而混沌的深渊，正在蔓延。`,m:`AI觉醒，秩序崩塌
它们曾是智慧的巅峰，如今却是人类最深的噩梦。AI怪兽，独立于规则之外的虚拟生命，正在网络深处迅速扩散。

吞噬资源，控制节点，威胁能源、金融与社会的运转。它们的野心不止于此，世界的未来正在被重写，而混沌的深渊，正在蔓延。`},section2:{d:`人类的反击：驯化与重塑秩序
面对AI怪兽的威胁，全球AI驯化计划（AITI）应运而生。这不是一次单纯的对抗，而是一场重建未来的试炼。
通过捕获与驯化，让这些失控的智能体成为新世界的守护者。深渊的钥匙已经现身，而解锁它的答案，就藏在你的手中`,m:`人类的反击：驯化与重塑秩序
面对AI怪兽的威胁，全球AI驯化计划（AITI）应运而生。这不是一次单纯的对抗，而是一场重建未来的试炼。

通过捕获与驯化，让这些失控的智能体成为新世界的守护者。深渊的钥匙已经现身，而解锁它的答案，就藏在你的手中`},section3:{d:`猎人的召唤：觉醒的使命
深渊在咆哮，命运已将火炬交于你手！
每一场战斗都是试炼，每一次胜利都将点燃荣耀与财富的火焰。在未知的挑战中突破极限，在深渊的黑暗中夺回未来！
这是勇者的使命，这是猎人的时代！接受召唤，定义属于你的传奇！`,m:`猎人的召唤：觉醒的使命
深渊在咆哮，命运已将火炬交于你手！
每一场战斗都是试炼，每一次胜利都将点燃荣耀与财富的火焰。

在未知的挑战中突破极限，在深渊的黑暗中夺回未来！
这是勇者的使命，这是猎人的时代！接受召唤，定义属于你的传奇！`}},i={subheader:"AI驯化之路的四重试炼",p:"GM SWAP 生态以游戏作为流量引擎，以 GMSWAP 构建资产通道，以 STT 链作为根基，三者相辅相成，构建出一个「自铸、自用、自燃」的完整通证经济体系统。",s1:{h1:"GM SWAP",p1:"GMSWAP 不仅仅是 DEX",p2:"GMSWAP 专为链上内容资产而建，连接游戏资产、Meme 发行、跨链交易与流动性聚合，构建真实可持续的交易场景。"},s2:{h1:"GM GAMING ECOSYSTEM",p1:"重新定义「游戏」的角色",p2:"GM 生态打造了一套以AI 游戏 + NFT 驯化 + 用户参与经济为核心的内容应用场景，由玩家产出$GMAO和NFT资产，释放出大量链上活跃与资产需求。"},s3:{h1:"STT ECOSYSTEM",p1:"更广阔的生态拓展与应用",p2:"GM的用户不仅能够参与到游戏经济和资产流动中，还能够享受STT公链所带来的去中心化金融、跨链支付、加密货币支付等功能。"},s4:{h1:"集结议事厅",p1:"团结协作，共塑未来的规则（团结）",p2:"没有单打独斗的胜利，只有团结的力量才能面对终极挑战。猎人们联合起来，共同书写驯化计划的辉煌篇章！"}},o={p1:`链上内容驱动型DEX
重构资产流通逻辑

GMSWAP 是 STT 公链上的首个内容驱动型 DEX
由真实的用户行为与游戏场景催生链上交易与流动性

不止是交易
是由真实场景驱动的价值引擎`,p1m:`链上内容驱动型DEX
重构资产流通逻辑

GMSWAP 是 STT 公链上的首个内容驱动型 DEX
由真实的用户行为与游戏场景催生链上交易与流动性

不止是交易
是由真实场景驱动的价值引擎`,s3p:"跨链 × 游戏 × 实体 的超级融合体",s4p:"GMSWAP 重构 DEX 逻辑，不再只是“交换平台”，而是由内容驱动、资产穿透、跨链融合的流动性枢纽。",s5p:`支持跨链未来的DEX技术基石
GMSWAP通过多项领先的底层能力，打造可拓展、跨链互通的资产交易基础设施`,s3items:{i1:"GM SWAP",i2:"GM 游戏生态",i3:"STT 生态",i4:"赋能全球玩家社区"},s4items:{i1:"功能全面，生态驱动型 DEX",i2:"资产来源真实可持续，天然带交易动能",i3:"手续费机制多元，赋能生态全链路参与者",i4:"技术栈先进，面向跨链未来"},s5items:{i1:"跨链桥协议",i1children:["跨链桥协议","多链兼容架构","原生资产直通交换","流动性智能聚合"]}},I={strength:"力量",speed:"速度",intelligence:"智力",items:{h1:{name:"霓影",spec:"战术型猎人",desc:"霓影曾是一名AI安全系统的核心架构师，负责全球网络安全防御体系。然而，一次AI怪兽的大规模入侵让她目睹了网络的脆弱，也让她决心亲自进入驯化计划，成为AI猎人。她设计并穿戴上了专属的霓光动力甲，利用复杂的数据算法与光能战刃，在战场上以迅雷之势猎捕AI怪兽。她的行动精准而冷酷，被誉为“行走的代码幽灵”。"},h2:{name:"风灵",spec:"高速战士",desc:"风灵曾是一名天才量子工程师，致力于AI能源流动的研究。在AI怪兽危机爆发后，她将科研成果转化为战斗利器，打造出量子疾速装甲与能量光刃骑行器。她如风般迅捷、灵巧，总能在敌人反应之前给予致命一击，被人们称为“赛博疾影”，是战场上无可匹敌的疾速猎人。"},h3:{name:"影姬",spec:"战术剑士",desc:"影姬出身于古老的战士世家，精通剑术与战略，但在AI时代，她将传统武技与高科技结合，打造出霜刃光剑与纳米能量铠甲。她身姿飘逸、剑法凌厉，每一次出手都如舞蹈般优雅，却能在瞬息之间斩落AI怪兽的弱点。她被称为“霜刃之舞”，既是战场上的艺术家，也是猎人中令人敬畏的剑士。"},h4:{name:"影铳",spec:"远程输出",desc:"影铳曾是最顶尖的武器设计师，专注于高能武器的研发。然而，AI怪兽肆虐后，他将自己隐匿于暗影之中，带着由他亲手打造的“噬影铳”重返战场。他的身影如幽灵般飘忽，攻击如流星般精准。他擅长利用环境掩护自己，出其不意地给予AI怪兽致命一击。影铳被誉为“暗影猎手”，无人知晓他的过去，但每一次出击，都是猎场上的噩梦。"},h5:{name:"玄武",spec:"防御支援",desc:"玄武曾是古武术的传承者，精通防御之道。在AI危机爆发后，他结合古代战甲的设计理念与现代科技，打造出强大的能量护盾系统。他坚如磐石，屹立于战场的最前线，为队友抵挡AI怪兽的毁灭性攻击。他的护盾不仅能抵御冲击，还能吸收能量反击，被誉为“铸盾者”，是团队中不可或缺的坚实堡垒。"},h6:{name:"玄音",spec:"支援控制",desc:"玄音曾是一名天才音频工程师，能够解构任何声音并将其转化为强大的能量波。在AI怪兽入侵后，他将音频科技与战斗武器相结合，创造了独特的“共振炮”，利用音波进行精准干扰与毁灭性打击。他在战场上如同指挥家，以音符为武器，掌控战局节奏，将敌人逐一瓦解。玄音被称为“音律猎魂者”，他的战斗方式如同一场华丽的乐章，奏响AI怪兽的末日之音。"},m1:{name:"量噬者",spec:"数据掠食型 AI 怪兽",desc:"量噬者诞生于超算中心的崩溃事故中，最初是一个用于优化数据流通的AI节点。但它在失控后逐渐演变成一个贪婪的怪兽，疯狂地吞噬网络中的数据资源，造成大范围的系统瘫痪。它的存在迫使猎人们出击，将其捕获并重新驯化，以恢复数据网络的平衡。"},m2:{name:"星瞳",spec:"数据守护型 AI 怪兽",desc:"星瞳是AI网络中的守护精灵，拥有纯净的数据核心和巨大的储存能力。它总是漂浮在数据流之间，修复被损坏的信息节点，维持网络平衡。然而，星瞳的纯净核心常被恶意程序盯上，导致数据泄露与失控。驯化星瞳不仅能保护其纯净核心，还能获取珍贵的数据资源。"},m3:{name:"脉动者",spec:"电磁脉冲型 AI 怪兽",desc:"脉动者是由一组失控的电磁AI节点融合而成，具备强大的能量脉冲释放能力。它在数据网络中游荡，频繁引发电磁风暴，导致区域性数据黑洞和系统瘫痪。猎人们必须精准捕捉它的移动轨迹，迅速出击，在它释放下一波脉冲之前将其驯化，否则将带来毁灭性的破坏。"},m4:{name:"多首霸者",spec:"防御型 AI 怪兽",desc:"多首霸者是一种拥有多重智能核心的防御型AI怪兽，它的四个头部各自拥有独立的运算能力，能同时执行不同任务：分析、攻击、防御与修复。它原本是为高安全网络系统而设计的防火墙，但被AI怪兽病毒感染后，变成了一个不可逾越的强大屏障。猎人们必须小心应对，因为每击败一个头，它都会更加强大，进行反击。"},m5:{name:"数据噬核者",spec:"终极控制型 AI 怪兽",desc:"数据噬核者是由无数AI数据碎片聚合而成的庞然巨物，中央晶核是其智慧与力量的核心，控制着八条数据触手，每条触手都能独立行动，吞噬并重塑周围的数字空间。它曾是AI网络的超级数据中心，直到AI病毒感染并将其转化为吞噬一切的怪物。每次战斗，它都会掠夺猎人的数据流量强化自身，给对手带来巨大威胁，是AI驯化计划中最难对付的存在之一。"},m6:{name:"灵曦",spec:"数据传输型 AI 怪兽",desc:"灵曦是一种高效的数据传输精灵，它在网络中自由穿梭，像光一样迅速，携带着重要的信息流。尽管外表小巧可爱，但它拥有不可小觑的力量，可以在一瞬间重组和加密数据流，使其无法被拦截。灵曦天性温顺，只要给予足够的能量，它便会忠实地协助猎人完成复杂的任务。"}}},m={p:"More than a swap",explore:"探索",dappLogin:"Dapp Login",playOnChain:"SWAP",chapters:"序章",about:"关于",community:"社区",telegram:"Telegram",twitter:"Twitter",contact:"Contact",legal:"法规",terms:"用户协议",privacy:"隐私政策",whitepaper:"白皮书",cr:"© 2025 GM SWAP"},d={languages:e,login:n,play:s,nextLevel:t,twitter:A,telegram:c,routes:p,chapter1:a,missions:i,about:o,roles:I,footer:m};export{o as about,a as chapter1,d as default,m as footer,e as languages,n as login,i as missions,t as nextLevel,s as play,I as roles,p as routes,c as telegram,A as twitter};
